Trees-simulation-different-porosities/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions



# runApplication surfaceFeatureExtract

# runApplication blockMesh

# runApplication decomposePar
# runParallel snappyHexMesh -overwrite

# #- For non-parallel running
# #cp -r 0.orig 0 > /dev/null 2>&1

# #- For parallel running
# ls -d processor* | xargs -I {} rm -rf ./{}/0
# ls -d processor* | xargs -I {} cp -r 0.orig ./{}/0

runParallel patchSummary
runParallel potentialFoam
runParallel $(getApplication)

runApplication reconstructParMesh -constant
runApplication reconstructPar

#------------------------------------------------------------------------------
